ninety-nine-cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["name", "DanielLi"], ["updated_at", "2022-08-26 20:07:25.269672"], ["id", 1]]
---
  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)